Repository: pingfangx/TranslatorX-other
Catalog: JavaTutorial/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: We won't examine the specific steps the virtual machine takes  it is enough to know that the single expression c++ can be decomposed into three steps:
zh_cn: 在这里，我们不深究虚拟机具体上上面的操作翻译成了什么样的步骤——只需要知道即使简单的c++ 这样的表达式也是会被翻译成三个步骤的：

source: We won't examine this package in detail, but instead will focus on its most basic interface, Lock.
zh_cn: 我们不会详细地测试这个包，只重点关注最基本的接口Lock。

source: We'll examine some of these methods in the following sections.
zh_cn: 我们将在以下部分中检验其中的一些方法。

source: We've already seen two actions that create happens-before relationships.
zh_cn: 到目前为止，我们已经看到了两种建立这种 happens-before 的方式：

source: What if a thread goes a long time without invoking a method that throws InterruptedException?
zh_cn: 若线程长时间没有调用方法抛出 InterruptedException？

source: What's more, it also means that when a thread reads a volatile variable, it sees not just the latest change to the volatile, but also the side effects of the code that led up the change.
zh_cn: 更重要的是，这也意味着当一个线程读取一个 volatile变量时，它不仅仅看到了对volatile变量的最后一次修改，还看到了导致这种修改的代码带来的其他影响。

source: When Deadlock runs, it's extremely likely that both threads will block when they attempt to invoke bowBack.
zh_cn: 当Deadlock 运行时，当两个线程尝试执行bowBack时，它们非常有可能都被阻塞。

source: When wait is invoked, the thread releases the lock and suspends execution.
zh_cn: 当调用 wait 方法时，线程释放锁并挂起。

source: When a statement invokes Thread.start, every statement that has a happens-before relationship with that statement also has a happens-before relationship with every statement executed by the new thread.
zh_cn: 当一条语句中调用了 Thread.start那么每一条和该语句已经建立了 happens-before 的语句都和新线程中的每一条语句有着这种 happens-before关系。

source: When a thread checks for an interrupt by invoking the static method Thread.interrupted, interrupt status is cleared.
zh_cn: 当一个线程通过调用静态方法Thread.interrupted检查中断，中断状态被清除。

source: When a thread invokes d.wait, it must own the intrinsic lock for d  otherwise an error is thrown.
zh_cn: 当一个线程调用 d.wait方法时，它必须拥有 d的内部锁——否则会抛出异常。

source: When a thread invokes a synchronized method, it automatically acquires the intrinsic lock for that method's object and releases it when the method returns.
zh_cn: 当一个线程调用一个同步方法的时，它会自动地获取该方法所属对象的内部锁，并在方法返回的时候释放该锁。

source: When a thread releases an intrinsic lock, a happens-before relationship is established between that action and any subsequent acquisition of the same lock.
zh_cn: 当一个线程释放了一个内部锁，那么就会建立起该动作和后续获取该锁之间的 happens-before 关系。

source: When a thread terminates and causes a Thread.join in another thread to return, then all the statements executed by the terminated thread have a happens-before relationship with all the statements following the successful join.
zh_cn: 当一个线程终止了并导致另外的线程中调用Thread.join 那么此时这个终止了的线程中执行了的所有语句都与随后的 join 语句随后的所有语句建立了这种 happens-before 。

source: When one thread is executing a synchronized method for an object, all other threads that invoke synchronized methods for the same object block (suspend execution) until the first thread is done with the object.
zh_cn: 当一个线程在执行一个对象的同步方式的时候，其他所有的调用该对象的同步方法的线程都会被挂起（暂停执行），直到第一个线程对该对象操作完毕。

source: Whether the extra effort is worthwhile depends on the size and complexity of the application.
zh_cn: 这种额外的付出是否值得完全取决于应用程序的大小和复杂度。

source: Which of these idioms should you use?
zh_cn: 这些方式应该使用哪一个呢？

source: Why is this version of guardedJoy synchronized?
zh_cn: 为什么这个版本的guardedJoy 是同步的？

source: With a limit on the number of the threads that can be created, the application will not be servicing HTTP requests as quickly as they come in, but it will be servicing them as quickly as the system can sustain.
zh_cn: 如果限制 Web 服务器可以创建的线程数量，那么它就不必立即处理所有收到的请求，而是在有能力处理请求时才处理。

source: Without reentrant synchronization, synchronized code would have to take many additional precautions to avoid having a thread cause itself to block.
zh_cn: 如果没有重入同步，在编写同步代码时需要额外的小心，以避免线程将自己阻塞。

source: Worker threads that run out of things to do can steal tasks from other threads that are still busy.
zh_cn: 完成自己的工作而处于空闲的工作线程能够从其他仍然处于忙碌(busy)状态的工作线程处窃取等待执行的任务。

source: Would it help to change the parameters of the two invocations of Sleep?
zh_cn: 是否有助于更改 Sleep 的两次调用的参数？

source: Would such an invocation make sense?
zh_cn: 这样的调用是否有意义？

source: Wrap this code in a ForkJoinTask subclass, typically using one of its more specialized types, either RecursiveTask (which can return a result) or RecursiveAction.
zh_cn: 你需要将这段代码包裹在一个ForkJoinTask 子类中，通常情况下会使用一种更为具体的的类型，RecursiveTask （它可以返回一个结果）或是 RecursiveAction。

source: You can take advantage of concurrent processing on multiprocessor systems by implementing the algorithm using the fork/join framework.
zh_cn: 如果使用 fork/join 框架来实现这个模糊算法，你就能够借助多处理器系统的并行处理能力。

source: You might be tempted to add the following line to your constructor:
zh_cn: 我们可能会在构造函数中添加下列语名：

source: You might wonder what happens when a static synchronized method is invoked, since a static method is associated with a class, not an object.
zh_cn: 您可能会想知道当调用静态同步方法时会发生什么，因为静态方法与一个类而不是一个对象相关联。

source: You must be absolutely sure that it really is safe to interleave access of the affected fields.
zh_cn: 我们必须绝对确保相关字段的访问交错是完全安全的。

source: Your code should look similar to the following pseudocode:
zh_cn: 你的代码结构看起来应该与下面所示的伪代码类似：

source: causes the current thread to pause execution until t's thread terminates.
zh_cn: 它会导致当前线程暂停执行直到t线程终止。

source: do the work directly else
zh_cn: 直接完成这个任务 else

source: if (my portion of the work is small enough)
zh_cn: if (当前这个任务工作量足够小)

source: invoke the two pieces and wait for the results
zh_cn: 分别执行这两个子任务，并等待结果

source: split my work into two pieces
zh_cn: 将这个任务或这部分工作分解成两个部分

source: with
zh_cn: 替换为
